In [10]:
import pandas as pd

In [2]:
titanic = pd.read_csv('titanic.csv')

In [3]:
bike = pd.read_csv('bike_kaggle.csv')

In [5]:
bike.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40

In [6]:
titanic.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

# Todo
- Load csv and set index
- Select some column
- select some data using [], iloc, loc
- Boolean selection using &, | , ~

In [7]:
True and True

True

In [9]:
not True

False

In [15]:
df = pd.read_csv('bike_kaggle.csv', index_col='datetime', nrows=5,
                usecols = ['weather', 'temp', 'datetime'] )

In [19]:
df = pd.read_csv('bike_kaggle.csv', index_col='datetime' )

In [21]:
df.head(2)

,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
datetime,,,,,,,,,,,
2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40

In [23]:
df['season'].head()

datetime
2011-01-01 00:00:00    1
2011-01-01 01:00:00    1
2011-01-01 02:00:00    1
2011-01-01 03:00:00    1
2011-01-01 04:00:00    1
Name: season, dtype: int64

In [24]:
df[['season', 'holiday']].head(2)

                     season  holiday
datetime
2011-01-01 00:00:00       1        0
2011-01-01 01:00:00       1        0

In [25]:
df.iloc[:3,:3]

                     season  holiday  workingday
datetime
2011-01-01 00:00:00       1        0           0
2011-01-01 01:00:00       1        0           0
2011-01-01 02:00:00       1        0           0

In [27]:
df.loc[:,'weather':'casual'].head(2)

                     weather  temp   atemp  humidity  windspeed  casual
datetime
2011-01-01 00:00:00        1  9.84  14.395        81        0.0       3
2011-01-01 01:00:00        1  9.02  13.635        80        0.0       8

In [29]:
filt = df['temp']>10
df[filt].head(2)

,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
datetime,,,,,,,,,,,
2011-01-01 09:00:00,1,0,0,1,13.12,17.425,76,0.0000,8,6,14
2011-01-01 10:00:00,1,0,0,1,15.58,19.695,76,16.9979,12,24,36

In [32]:
df.head()

,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
datetime,,,,,,,,,,,
2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40
2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32
2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13
2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1

In [34]:
filt1 = df['temp']>10
filt2 = df['atemp']>20
filt = filt1 & filt2
df.loc[~filt, ['temp','atemp']].head(2)

                     temp   atemp
datetime
2011-01-01 00:00:00  9.84  14.395
2011-01-01 01:00:00  9.02  13.635

In [39]:
any(~filt == (~filt1) | (~filt2))

True

In [56]:
df.head(1)

,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
datetime,,,,,,,,,,,
2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16

# Series

In [46]:
s = df['temp']

In [51]:
s

datetime
2011-01-01 00:00:00     9.84
2011-01-01 01:00:00     9.02
2011-01-01 02:00:00     9.02
2011-01-01 03:00:00     9.84
2011-01-01 04:00:00     9.84
                       ...
2012-12-19 19:00:00    15.58
2012-12-19 20:00:00    14.76
2012-12-19 21:00:00    13.94
2012-12-19 22:00:00    13.94
2012-12-19 23:00:00    13.12
Name: temp, Length: 10886, dtype: float64

In [48]:
type(s)

pandas.core.series.Series

In [52]:
s.mean()

20.230859819952173

In [54]:
s.abs()

datetime
2011-01-01 00:00:00     9.84
2011-01-01 01:00:00     9.02
2011-01-01 02:00:00     9.02
2011-01-01 03:00:00     9.84
2011-01-01 04:00:00     9.84
                       ...
2012-12-19 19:00:00    15.58
2012-12-19 20:00:00    14.76
2012-12-19 21:00:00    13.94
2012-12-19 22:00:00    13.94
2012-12-19 23:00:00    13.12
Name: temp, Length: 10886, dtype: float64

# count

In [55]:
s.count()

10886

In [57]:
titanic.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [58]:
age = titanic['Age']

In [59]:
age.count()

714

In [60]:
age.quantile(0.99)

65.87

In [61]:
age.median()

28.0

# missing values

In [63]:
age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [64]:
age.isna().sum()

177

In [66]:
len(age) - age.count()

177

In [67]:
age.isna().mean()

0.19865319865319866

# Sorting

In [68]:
age.head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [71]:
age.sort_values()

803    0.42
755    0.67
644    0.75
469    0.75
78     0.83
       ...
859     NaN
863     NaN
868     NaN
878     NaN
888     NaN
Name: Age, Length: 891, dtype: float64

In [72]:
age.sort_values(ascending=False)

630    80.0
851    74.0
96     71.0
493    71.0
116    70.5
       ...
859     NaN
863     NaN
868     NaN
878     NaN
888     NaN
Name: Age, Length: 891, dtype: float64

In [74]:
age.sort_index(ascending=False)

890    32.0
889    26.0
888     NaN
887    19.0
886    27.0
       ...
4      35.0
3      35.0
2      26.0
1      38.0
0      22.0
Name: Age, Length: 891, dtype: float64

# basic statistis

In [76]:
age.describe(percentiles=[0.1,0.2,0.3])

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
10%       14.000000
20%       19.000000
30%       22.000000
50%       28.000000
max       80.000000
Name: Age, dtype: float64

In [79]:
age.describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [80]:
age.agg(['min', 'max', 'mean'])

min      0.420000
max     80.000000
mean    29.699118
Name: Age, dtype: float64

In [81]:
age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [83]:
age.cummin().head(10)

0    22.0
1    22.0
2    22.0
3    22.0
4    22.0
5     NaN
6    22.0
7     2.0
8     2.0
9     2.0
Name: Age, dtype: float64

In [84]:
age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [85]:
age.cumsum()

0         22.00
1         60.00
2         86.00
3        121.00
4        156.00
         ...
886    21128.17
887    21147.17
888         NaN
889    21173.17
890    21205.17
Name: Age, Length: 891, dtype: float64

In [89]:
age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [90]:
age.rank()

0      218.0
1      532.0
2      310.5
3      488.5
4      488.5
       ...
886    328.5
887    152.0
888      NaN
889    310.5
890    437.5
Name: Age, Length: 891, dtype: float64

In [92]:
age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [91]:
age.diff()

0       NaN
1      16.0
2     -12.0
3       9.0
4       0.0
       ...
886   -12.0
887    -8.0
888     NaN
889     NaN
890     6.0
Name: Age, Length: 891, dtype: float64

In [93]:
age.pct_change()

0           NaN
1      0.727273
2     -0.315789
3      0.346154
4      0.000000
         ...
886   -0.307692
887   -0.296296
888    0.000000
889    0.368421
890    0.230769
Name: Age, Length: 891, dtype: float64

In [94]:
age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [95]:
age.dropna()

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
885    39.0
886    27.0
887    19.0
889    26.0
890    32.0
Name: Age, Length: 714, dtype: float64

In [97]:
age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [100]:
age.fillna(age.median())

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    28.0
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [102]:
age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [119]:
age.sample(n=10, random_state=8)

350    23.0
176     NaN
723    50.0
404    20.0
306     NaN
665    32.0
607    27.0
151    22.0
265    36.0
865    42.0
Name: Age, dtype: float64

In [108]:
age.sample(frac=0.1)

625    61.0
867    31.0
20     35.0
390    36.0
494    21.0
       ...
189    36.0
502     NaN
408    21.0
233     5.0
135    23.0
Name: Age, Length: 89, dtype: float64

In [111]:
age.sample(n=10, replace=True)

519    32.0
77      NaN
36      NaN
677    18.0
677    18.0
721    17.0
871    47.0
242    29.0
230    35.0
172     1.0
Name: Age, dtype: float64

In [120]:
age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [124]:
df = pd.read_csv('titanic.csv', index_col = 'Name')

In [125]:
age = df['Age']

In [126]:
age

Name
Braund, Mr. Owen Harris                                22.0
Cumings, Mrs. John Bradley (Florence Briggs Thayer)    38.0
Heikkinen, Miss. Laina                                 26.0
Futrelle, Mrs. Jacques Heath (Lily May Peel)           35.0
Allen, Mr. William Henry                               35.0
                                                       ...
Montvila, Rev. Juozas                                  27.0
Graham, Miss. Margaret Edith                           19.0
Johnston, Miss. Catherine Helen "Carrie"                NaN
Behr, Mr. Karl Howell                                  26.0
Dooley, Mr. Patrick                                    32.0
Name: Age, Length: 891, dtype: float64

In [140]:
df.head(2)

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C

In [139]:
age.loc['Braund, Mr. Owen Harris':'Heikkinen, Miss. Laina' ]

Name
Braund, Mr. Owen Harris                                22.0
Cumings, Mrs. John Bradley (Florence Briggs Thayer)    38.0
Heikkinen, Miss. Laina                                 26.0
Name: Age, dtype: float64

In [141]:
age.max()

80.0

In [142]:
age.idxmax()

'Barkworth, Mr. Algernon Henry Wilson'

In [143]:
age.idxmin()

'Thomas, Master. Assad Alexander'

In [144]:
df.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,female,35.0,1,0,113803,53.1000,C123,S
"Allen, Mr. William Henry",5,0,3,male,35.0,0,0,373450,8.0500,NaN,S

In [146]:
emb = df['Embarked']
emb

Name
Braund, Mr. Owen Harris                                S
Cumings, Mrs. John Bradley (Florence Briggs Thayer)    C
Heikkinen, Miss. Laina                                 S
Futrelle, Mrs. Jacques Heath (Lily May Peel)           S
Allen, Mr. William Henry                               S
                                                      ..
Montvila, Rev. Juozas                                  S
Graham, Miss. Margaret Edith                           S
Johnston, Miss. Catherine Helen "Carrie"               S
Behr, Mr. Karl Howell                                  C
Dooley, Mr. Patrick                                    Q
Name: Embarked, Length: 891, dtype: object

In [147]:
emb.unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [149]:
emb.nunique(dropna=False)

4

In [151]:
emb.value_counts(dropna=False)

S      644
C      168
Q       77
NaN      2
Name: Embarked, dtype: int64

In [152]:
set(emb)

{'C', 'Q', 'S', nan}

In [157]:
emb.value_counts(normalize=True)

S    0.724409
C    0.188976
Q    0.086614
Name: Embarked, dtype: float64

In [158]:
emb.drop_duplicates()

Name
Braund, Mr. Owen Harris                                  S
Cumings, Mrs. John Bradley (Florence Briggs Thayer)      C
Moran, Mr. James                                         Q
Icard, Miss. Amelie                                    NaN
Name: Embarked, dtype: object

In [162]:
df['Sex']

Name
Braund, Mr. Owen Harris                                  male
Cumings, Mrs. John Bradley (Florence Briggs Thayer)    female
Heikkinen, Miss. Laina                                 female
Futrelle, Mrs. Jacques Heath (Lily May Peel)           female
Allen, Mr. William Henry                                 male
                                                        ...
Montvila, Rev. Juozas                                    male
Graham, Miss. Margaret Edith                           female
Johnston, Miss. Catherine Helen "Carrie"               female
Behr, Mr. Karl Howell                                    male
Dooley, Mr. Patrick                                      male
Name: Sex, Length: 891, dtype: object

In [163]:
df['Sex'].max()

'male'

In [165]:
ord('m')

109

In [166]:
ord('f')

102

In [164]:
df['Cabin'].dropna().max()

'T'

In [167]:
df = pd.read_csv('titanic.csv')

In [168]:
name = df['Name']

In [169]:
name.head()

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
Name: Name, dtype: object

In [177]:
name.str.lower().str.contains('master').sum()

40

In [178]:
name.str.lower().str.contains('miss').sum()

182

In [182]:
name.str.contains('Mr').sum()

647

In [180]:
name.str.lower().str.contains('mrs').sum()

129

In [184]:
df = pd.read_csv('bike_kaggle.csv', parse_dates = ['datetime'])

In [186]:
df.head(1)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01,1,0,0,1,9.84,14.395,81,0.0,3,13,16

In [187]:
date = df['datetime']

In [188]:
date

0       2011-01-01 00:00:00
1       2011-01-01 01:00:00
2       2011-01-01 02:00:00
3       2011-01-01 03:00:00
4       2011-01-01 04:00:00
                ...
10881   2012-12-19 19:00:00
10882   2012-12-19 20:00:00
10883   2012-12-19 21:00:00
10884   2012-12-19 22:00:00
10885   2012-12-19 23:00:00
Name: datetime, Length: 10886, dtype: datetime64[ns]

In [189]:
date.dt.month

0         1
1         1
2         1
3         1
4         1
         ..
10881    12
10882    12
10883    12
10884    12
10885    12
Name: datetime, Length: 10886, dtype: int64

In [191]:
date.dt.hour

0         0
1         1
2         2
3         3
4         4
         ..
10881    19
10882    20
10883    21
10884    22
10885    23
Name: datetime, Length: 10886, dtype: int64

In [194]:
(date.dt.weekday > 4).mean()

0.2905566783024068

In [196]:
date.iloc[1] - date.iloc[0]

Timedelta('0 days 01:00:00')

In [199]:
date.dt.strftime('%A %B %d, %Y, %r')

0          Saturday January 01, 2011, 12:00:00 AM
1          Saturday January 01, 2011, 01:00:00 AM
2          Saturday January 01, 2011, 02:00:00 AM
3          Saturday January 01, 2011, 03:00:00 AM
4          Saturday January 01, 2011, 04:00:00 AM
                           ...
10881    Wednesday December 19, 2012, 07:00:00 PM
10882    Wednesday December 19, 2012, 08:00:00 PM
10883    Wednesday December 19, 2012, 09:00:00 PM
10884    Wednesday December 19, 2012, 10:00:00 PM
10885    Wednesday December 19, 2012, 11:00:00 PM
Name: datetime, Length: 10886, dtype: object

In [35]:
filt

datetime
2011-01-01 00:00:00    False
2011-01-01 01:00:00    False
2011-01-01 02:00:00    False
2011-01-01 03:00:00    False
2011-01-01 04:00:00    False
                       ...
2012-12-19 19:00:00    False
2012-12-19 20:00:00    False
2012-12-19 21:00:00    False
2012-12-19 22:00:00    False
2012-12-19 23:00:00    False
Length: 10886, dtype: bool